/************************************************************************/
/* 	寄存器位定义头文件									                */
/* 	主要功能:															*/
/* 		1.中断处理程序	                            */
/*	硬件平台：	 													  	*/
/*		FM340			                        	*/
/* 	编制:xudayong														*/
/* 	编制时间:2014年10月30日												*/
/************************************************************************/

#include "init.h"
#include "LoraEp.h"


/************************************************************************/
/* 函数名：nmi_ISR													*/
/* 功能说明：nmi中断处理程序						*/
/* 入口参数：N/A													*/
/* 出口参数：N/A													*/
/* 时间:  																*/
/* 作者: 													*/
/************************************************************************/
void nmi_ISR (void) interrupt 7 using 1
{
	unsigned char i;

 	if(NMIFLAG & pmu_int)
 	{ 				
		if(PMU_WKSRC & B0000_1111)
		{
			WkupHander();
			PMU_WKSRC = 0;
		}		
 	} 	
	NMIFLAG = 0;
}

/************************************************************************/
/* 函数名：Int0_ISR													    */
/* 功能说明：外部中断处理程序   						                */
/* 入口参数：N/A													    */
/* 出口参数：N/A													    */
/* 时间:  																*/
/* 作者:  	         													*/
/************************************************************************/
void Int0_ISR (void) interrupt 0 using 1
{	
	//------------------- LVDINT ----------------------//
	INIT_CLK();
	Init_IO_PAD();
//------------------- svd ----------------------//
	if(LVDSTAT & lvdpu_if)
	{
		LVDSTAT &= ~lvdpu_if;

	}
	if(LVDSTAT & lvdpd_if)
	{
 		//此处增加SVD检测处理函数
		SVDHander();
		LVDSTAT &= ~lvdpd_if;

	}		
	
	//------------------- lptim ----------------------//	
		if((LPTIMIF & trig_if) && (LPTIMIE & trig_ie))
		{			
			LPTIMIF &= ~trig_if;
		}
		if((LPTIMIF & ovif) && (LPTIMIE & ovie))
		{			
			//LP_tim_cnt++;
			//此处增加LPTIM处理函数
			LpTimHander();
			LPTIMIF &= ~ovif;
		}	
		if((LPTIMIF & compif) && (LPTIMIE & compie))
		{			
			LPTIMIF &= ~compif;
		}	
}

/************************************************************************/
/* 函数名：Timer0_ISR													*/
/* 功能说明：Timer0中断处理程序						                    */
/* 入口参数：N/A													    */
/* 出口参数：N/A													    */
/* 时间:  																*/
/* 作者: 													            */
/************************************************************************/
void Timer0_ISR (void) interrupt 1 using 1
{
	//NOP
}

/************************************************************************/
/* 函数名：Int1_ISR													    */
/* 功能说明：外部中断1处理程序						                    */
/* 入口参数：N/A													    */
/* 出口参数：N/A													    */
/* 时间:  																*/
/* 作者: 													            */
/************************************************************************/
void Int1_ISR (void) interrupt 2 using 1
{
	//NOP
}

/************************************************************************/
/* 函数名：Timer1_ISR													*/
/* 功能说明：Timer1中断处理程序						                    */
/* 入口参数：N/A													    */
/* 出口参数：N/A													    */
/* 时间:  																*/
/* 作者: 													            */
/************************************************************************/
void Timer1_ISR (void) interrupt 3 using 1
{
	//NOP
}

/************************************************************************/
/* 函数名：es_ISR													*/
/* 功能说明：es中断处理程序						*/
/* 入口参数：N/A													*/
/* 出口参数：N/A													*/
/* 时间:  																*/
/* 作者: 													*/
/************************************************************************/
void es_ISR (void) interrupt 4 using 1
{
	
}

/************************************************************************/
/* 函数名：Timer2_ISR													*/
/* 功能说明：Timer2中断处理程序						                    */
/* 入口参数：N/A													    */
/* 出口参数：N/A													    */
/* 时间:  																*/
/* 作者: 													            */
/************************************************************************/
void Timer2_ISR (void) interrupt 5 using 1
{
	//NOP

}
/************************************************************************/
/* 函数名：PCA_ISR													*/
/* 功能说明：Timer2中断处理程序						                    */
/* 入口参数：N/A													    */
/* 出口参数：N/A													    */
/* 时间:  																*/
/* 作者: 													            */
/************************************************************************/
void PCA_ISR (void) interrupt 6 using 1
{
	//NOP
}

/************************************************************************/
/* 函数名：Eint0_ISR													*/
/* 功能说明：intextra_n0中断处理程序						*/
/* 入口参数：N/A													*/
/* 出口参数：N/A													*/
/* 时间:  																*/ 
/* 作者: 													*/
/************************************************************************/
void Eint0_ISR (void) interrupt 8 using 1
{


}
/************************************************************************/
/* 函数名：Eint1_ISR													*/
/* 功能说明：intextra_n1中断处理程序						*/
/* 入口参数：N/A													*/
/* 出口参数：N/A													*/
/* 时间:  																*/
/* 作者: 													*/
/************************************************************************/
void Eint1_ISR (void) interrupt 9 using 1
{

}


/************************************************************************/
/* 函数名：Eint2_ISR													*/
/* 功能说明：intextra_n2中断处理程序						*/
/* 入口参数：N/A													*/
/* 出口参数：N/A													*/
/* 时间:  																*/
/* 作者: 													*/
/************************************************************************/
void Eint2_ISR (void) interrupt 10 using 1
{

}

/************************************************************************/
/* 函数名：Eint3_ISR													*/
/* 功能说明：intextra_n3中断处理程序						*/
/* 入口参数：N/A													*/
/* 出口参数：N/A													*/
/* 时间:  																*/
/* 作者: 													*/
/************************************************************************/
void Eint3_ISR (void) interrupt 11 using 1
{

}

/************************************************************************/
/* 函数名：Eint4_ISR													*/
/* 功能说明：intextra_n4中断处理程序						*/
/* 入口参数：N/A													*/
/* 出口参数：N/A													*/
/* 时间:  																*/
/* 作者: 													*/
/************************************************************************/
void Eint4_ISR (void) interrupt 12 using 1
{
	
	
}

/************************************************************************/
/* 函数名：Eint5_ISR													*/
/* 功能说明：intextra_n5中断处理程序						*/
/* 入口参数：N/A													*/
/* 出口参数：N/A													*/
/* 时间:  																*/
/* 作者: 													*/
/************************************************************************/
void Eint5_ISR (void) interrupt 13 using 1
{

}

/************************************************************************/
/* 函数名：Eint6_ISR													*/
/* 功能说明：intextra_n6中断处理程序						*/
/* 入口参数：N/A													*/
/* 出口参数：N/A													*/
/* 时间:  																*/
/* 作者: 													*/
/************************************************************************/
void Eint6_ISR (void) interrupt 14 using 1
{

}
